week 6/D5/ninety_nine_cats/app/controllers/cats_controller.rb

  def show #/cats/:id
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]